let handler = async (m, { conn, participants, groupMetadata, command }) => {

    // SI ES GDC
    if (command === 'gdc' || command === 'guerradeclanes' || command === 'guerra') {
        const pp = await conn.profilePictureUrl(m.chat, 'image').catch(_ => null) || './storage/img/flor.jpg'
        const groupAdmins = participants.filter(p => p.admin)
        const owner = groupMetadata.owner || groupAdmins.find(p => p.admin === 'superadmin')?.id || m.chat.split`-`[0] + '@s.whatsapp.net'

        let text = `🌸✧･ﾟ: *🌷 𝙶𝙳𝙲 - 𝚂𝙰𝙺𝚄𝚁𝙸𝚃𝙰 𝙱𝙾𝚃 🌷* :ﾟ･✧🌸

👑 𝗝𝗔𝗥𝗗𝗜́𝗡: ${groupMetadata.subject}
⏰ 𝗛𝗢𝗥𝗔𝗥𝗜𝗢: __:__ 🇦🇷 / __:__ 🇵🇪

╭──────────────╮
│ㅤ🌷 𝗘𝗤𝗨𝗜𝗣𝗢 🌸𝟭
│
│👑 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│
│🌷 𝗘𝗤𝗨𝗜𝗣𝗢 🌸𝟮
│
│👑 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│
│🌷 𝗘𝗤𝗨𝗜𝗣𝗢 🌸𝟯
│
│👑 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│
│🌷 𝗘𝗤𝗨𝗜𝗣𝗢 🌸𝟰
│
│👑 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│
│🌷 𝗘𝗤𝗨𝗜𝗣𝗢 🌸𝟱
│
│👑 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│
│🌷 𝗘𝗤𝗨𝗜𝗣𝗢 🌸𝟲
│
│👑 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│
│ㅤ💮 𝗥𝗘𝗦𝗘𝗥𝗩𝗔𝗦:
│🌸 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
│🌸 ➤ ・
╰─────────────╯

🌸✧･ﾟ: *Completen y florezcan* :ﾟ･✧🌸`.trim()

        return await conn.sendFile(m.chat, pp, 'gdc.jpg', text, m, false, { mentions: [...groupAdmins.map(v => v.id), owner] })
    }

    // SI ES VS4 O VS6
    let titulares = command === 'vs6'? 6 : 4
    let suplentes = command === 'vs6'? 3 : 2

    let listaTitulares = ''
    for(let i = 1; i <= titulares; i++) {
        listaTitulares += `🌸 ${i}. ・\n`
    }

    let listaSuplentes = ''
    for(let i = 1; i <= suplentes; i++) {
        listaSuplentes += `🌷 ${i}. ・\n`
    }

    let plantilla = `🌸✧･ﾟ: *🌷 𝚂𝙰𝙺𝚄𝚁𝙸𝚃𝙰 𝙱𝙾𝚃 🌷* :ﾟ･✧🌸

👑 𝗖𝗨𝗜𝗗𝗔𝗗𝗢𝗥: ・
⏰ 𝗛𝗢𝗥𝗔: __:__ 🇦🇷 / __:__ 🇵🇪

───────────────
    🌸 𝗧𝗜𝗧𝗨𝗟𝗔𝗥𝗘𝗦 🌸
───────────────
${listaTitulares}
───────────────
   🌷 𝗥𝗘𝗦𝗘𝗥𝗩𝗔𝗦 🌷
───────────────
${listaSuplentes}
───────────────
   🎁 𝗔𝗡𝗙𝗜𝗧𝗥𝗜𝗢𝗡 🎁
───────────────
🌸 ・

🌸✧･ﾟ: *Completen y florezcan* :ﾟ･✧🌸`

    await conn.sendMessage(m.chat, { text: plantilla }, { quoted: m })
}

handler.help = ['vs4', 'vs6', 'gdc']
handler.tags = ['ff']
handler.command = /^(vs4|vs6|gdc|guerradeclanes|guerra)$/i
handler.group = true
handler.admin = true // SOLO ADMINS